{
    "reddit_stories": [
      {
        "summary": "My sister went ballistic after I chose to babysit my friend's kid and refused to look after her nightmare child.",
        "story": "I'm a 23 year old childfree woman (idk if this is needed for the story), and my sister is 30 with a 4 year old son. She's a single mom, ex-husband is not in the picture and has no contact with her or the kid. I'm gonna get straight to the point, that kid is a nightmare to be around. It's not his fault, it's my sister's fault. He very clearly has behavioral and mental health disorders, even at his young age. However, my sister was and is very ablest and refuses to accept that her son has problems. The kid screams bloody murder whenever something doesn't slightly go his way, screams and cries when he's overwhelmed, has meltdowns to certain sounds and textures. Like I said, I don't blame the kid for these issues, but my sister refusing to get him treatment or help makes the kid a nightmare to be around. So, as a result I don't babysit the kid when my sister asks (more like demands) I do so. This causes a lot of fights between us and our family.I have a friend, 23 M, who's married to a wonderful lady age 22 and they have a baby boy together who just turned 1. Yes they got married and had him young, but it's not my place to judge them. This past weekend they asked me to babysit for them, and I agreed for a few reasons. Their kid is calm, well behaved, and a general good kidtoddlerbaby to be around. I love babysitting him. Also, they asked me nicely and understood that I might say no because I'm childfree. They were polite about their request. A thing about me is that if you ask me to do something politely, even if it's something I wouldn't usually agree to, I'd probably do it because you were nice and polite. So for these reasons, I happily agreed to babysit the boy. My sister also asked me to babysit her son that day so she could have a day to herself, and I refused and told her I was already babysitting for my friends. She was pissed, to say the least. She said a few comments about how I was an ass and not a good sister, but I thought she dropped it after that.This past weekend, while I was watching the baby, my sister started banging on my door. I looked through the window and saw that she had her kid and a care bag with her, and I knew she was trying to drop him off and make me babysit. She was banging on the door, yelling at me and calling me heartless and a baby hater (while I was holding a baby, ironic) and that I better open up and do my sisterly duties. I put the baby in a different room to keep him from getting scared by the noise, and told my sister through the window to leave, or I would call the cops. She started cursing for a solid five minutes before she finally left. I had the whole thing on my doorbell camera and sent it to the family group chat. Surprisingly, my whole family is on my sister's side.She keeps arguing with me about how I'd rather babysit a kid not even related to me over my nephew. I reminded her that her kid is a nightmare to be around, but she keeps saying that for family you help out. My sister has been cold since, and keeps sending me text messages to provoke me into arguing with her more. She's also started saying some pretty ablest and nasty things towards my friend's wife. My friend's wife is on the spectrum and has BPD and my sister keeps saying that she should have been sterilized and never should have passed her issues to her kid (btw, her kid has shown none of the signs that autistic infants usually show so idk what my sister is on). I will admit that I do feel a bit guilty because I never consider babysitting my nephew, but I jumped at the opportunity to babysit my friend's kid. My sister, dad (66), mom (64) and brother (33) are all calling me an asshole and saying that I'm just using the CF label to avoid family responsibility. I need advice on how to get my family to see my perspective on this. How can I explain to them that the issue isn't the idea of babysitting, but it's the behavior of the kid? Update 3 days later... My original post was about 3 days ago, and ever since that post my sister's behavior escalated. I tried to talk to her about getting help for my nephew, and she kept screaming at me everytime I brought it up. She said a lot of derogatory terms towards people with mental illnesses and mental disabilities, terms I won't repeat here.That wasn't the only escalation. She was at my door several times a day starting 2 days ago (the day after I made my original post). Banging on my door, screaming, crying, cursing, the works. She brought my nephew each time and he always looked so confused and defeated. He was too tired to react or meltdown like he normally does around loud noises, and it broke my heart to see that on my doorbell camera.I wasn't at my house. I was crashing with my friend and his wife. I took the advice of a commenter who said to put some physical distance between me and my sister. They said I was free to stay as long as I wanted as long as I helped out with some house chores and childcare while I stayed, which I thought was more than fair. So I'm staying in their guest room currently. I'm still with them, even though my sister isn't much of a problem.Many will be glad to know, that my sister won't have parental rights over my nephew soon. She dropped him off at a safe haven site in the middle of the night. (Totally a fun phone call to wake up to at 2 in the morning. And my nephew is currently with my parents. Social services placed him with my parents, and he's set to have mandatory therapy. In my state (don't know if it's different in others) if a child is abandoned in anyway, safe haven or not, a physical and mental health examine is done. Other than being a little bit underweight, my nephew was physically health. He wasn't being physically abused like a few people were worried. But it was obvious he needed mental health, so he'll be starting therapy sessions soon, as mandated by a case worker.We are not looking for my sister. After she dropped her son off, she left. She had quit her job a few weeks back, sold her car, and even her house a few weeks ago and had been renting a place, so this was planned. In my personal opinion, she planned to abandon her son the day I was babysitting my friend's baby, which is why she had such a nuclear reaction. She did leave a note, saying she can't do it anymore, she met someone, and that she doesn't want to be a mom to my nephew anymore. In her note she said she deserves a normal kid, and not a burden like my nephew. I seriously hope that my sister doesn't have anymore kids with this mystery person she's referencing, but it seems like she's running off to start a new life and family. She still has 30 days to reclaim rights over my nephew, but it doesn't look like she'll do that. Time will tell.Like I said, I'm still with my friends because I was worried my sister would do something. My parents and brother have also been blowing up my phone and coming to my house, switching between apologies and blaming me for this. They think that maybe if I babysat that day, she wouldn't have done this, but I think she wanted me to babysit so she could do this. I'm not mad at them for blaming me, I understand that my sister is still their family and they're rightfully in shock and want someone to blame. They're human, and I know humans can be cruel sometimes while going through shock and grief.So, yeah, that's life right now. I'm currently sitting on the couch with my friend's baby while my friend is at work and his wife does a quick grocery run. She was going to take the baby, but I insisted on watching him so she didn't have to hassle with the car seat in the very stormy weather we have in our area right now.This update is all over the place, I feel like I'm rambling. There's still a lot of unknown stuff regarding my sister and nephew, but for now this is the update. I don't know if I'll post more regarding this situation. My friend's wife is telling me I should relax and just not think about anything relating to this until I'm more level headed, but I don't think that's possible.",
        "gender": "f"
      },
      {
        "summary": "My wife had a meltdown over our daughter's personality, all because she wants her to be a girly cheerleader with a boyfriend.",
        "story": "I'm a 34 year old guy, and I have a 16 year old stepdaughter. My wife is 31.In highschool, my wife was a \"popular girl\" stereotype. Pink, blonde chunky highlights in her brown hair, this was the mid-late 2000s. She was on the cheerleading team, had lots of friends and boyfriends, was well known and liked. She was basically the living embodiment of the picture perfect girl from those cheesey 2000s highschool movies. And then she got pregnant. When she was 15, she had her daughter. She doesn't know who the father is, and any potential fathers for the girl up and left way back when. Her daughter is recently 16.I never wanted kids, I found them annoying. But I fell in love with my wife and got married when she was 20 and I was 23 after dating for 2 years. We hit it off, and I married her and decided to suck it up around the kid.I never planned to absolutely love being a dad to her specifically. Kids still annoy me, but my daughter (step daughter technically) was different. She was quiet, nerdy even at a young age. I married her mother when she was 5, and we clicked right away. We went on daddy-daughter dates every weekend. I played dolls with her. Let her paint my nails and do makeup on me. I drove her to and from school in my cop car. We even did daddy-daughter duo costumes for Halloween.Over the past two years she's developed a darker dress style. I don't know what the proper subculture of her outfits are, but according to her she's dressing like a horror game protagonist and a Monster High character. Purple is her main color she incorporates into this specific \"aesthetic blend\" as she calls it. I don't get it, but maybe that's because I'm a man in my 30s, I don't know. She likes ghosts, tarot cards, vampires, zombies, aliens, creepy victorian dolls. I don't get it, but also I don't care because if it makes her happy so what? She's also an introvert, and prefers to play games on her computer or read fantasy occult novels rather than hangout with other teens her age. She has friends, so I'm not too worried about her being completely withdrawn. I'm just glad I don't have to drive her around since she only has a learner's permit currently.My wife hates this. My wife always wanted a girly girl. Pinks and pastels and flowers and all that. She wants our daughter to get a boyfriend, be more social, be a cheerleader like she was. Which, in itself is valid. I get it, I'm sure most every parents has preferences for what they want their kid to turn out like, and some disappointment when they stray from that fantasy is valid. Some.My wife will constantly takes and hides my daughter's darker room decor. She constantly gets pastel dresses for our daughter, tells her to wipe off her dark eye makeup, tries to set her up on dates with jock types from my daughter's school, and convince her to sign up for both school and summer activities like cheerleading or volleyball.I could have put up with all of that, I really could have. But a few weeks ago I woke up to my wife finally hitting finally hitting her breaking point. I woke up in the middle of the night to my wife screaming and having what I can confidently describe as a borderline meltdown. She was crying and saying all she ever wanted was a normal daughter who likes pink, and is a cheerleader and has a boyfriend and will give her grandkids. I had to drag her out the hallway after 30 minutes of this. I kept thinking it would stop, but it kept going on and on. My daughter was just staring at this whole thing in the doorway of her room. What caused this meltdown from my wife? My daughter dyed purple over the blonde streakshighlights my wife had forced her to get in her hair. Which wasn't even breaking a house rule, as my wife and I have both told her she can do whatever she wants with her hair as long as she doesn't stain too many towels.It's been weeks, and my daughter won't talk to her mom. My wife is still up with her antics, but now it's in overdrive. Everyday she brings home some type of trendy clothing in pink or pastels and tries to give it to my daughter. My daughter is getting fed up and stays in her room all day, and has confessed to me she can't wait for school to start back up in a few weeks so she can get out the house and be with her friends again.I don't know what to do. I feel like I'm stuck between a rock and a hard place. I don't want to \"side\" with anyone in this situation. I understand my wife wants a daughter who she can relate, and my daughter wants a mom who understands her. I don't know what I can or should do. I need help. I need advice. An update post is then made a week later. Two nights after I posted, I sat my wife down and very bluntly asked her what exactly the problem was. She kept saying she just wanted a daughter who was similar to her, but after I kept asking she broke down and admitted the real reason why she was having her meltdowns.My wife feels that her daughter is the only way for her to have more family in the future. She's estranged from her siblings, her parents don't speak much to her, and all of her friends from highschool stopped talking to her after her pregnancy. She wants a family back, and she's hoping that her daughter will marry a nice boy and give her grandkids so she can have a family again. She said she never brought up having more kids with me because she figured I'd be against the idea. I don't know how I feel about having more kids with my wife, but it certainly won't happen now.So my wife is in therapy to try and get her to realize that she can't just view my daughter as a way to create a family. She's doing well so far, but it's too soon to really tell.My daughter is also in therapy. She's been in therapy since she was a kid for bullying issues, but now her therapist is trying to focus on the meltdown situation with her. My daughter actually seems relatively unaffected by this whole situation other than a little annoyed, so I don't know if that's good or not.I took my daughter to Hot Topic for some back to school accessories and then took her out to eat, just the two of us. She's still excited to go back to school, she misses her friends and her clubs.My wife and daughter have started talking normally again. They had a long talk, which I was present for, where my wife apologized for being so pushy and extreme with her wishes. My daughter was well receptive to this talk and seems to be back to her normal self, I am keeping an eye on both of them to be sure. My wife is doing her best to understand my daughter's interests. Last I know the two were watching some slasher TV show on Hulu as a way to bond, and it appears to be working. There isn't any bad blood between the two.I know things are soon, and that things can change, but so far everything appears to be smoothing over pretty well. Thank you for all the advice, harsh and gentle, that I reviewed through my original post. It definitely slapped me in the face as what could happen if I didn't get both of them help and make them talk it out.",
        "gender": "m"
      },
      {
        "summary": "Boyfriend (25M) became disabled and I (25F) want to break up but I'd feel like a terrible person. How do I handle this?",
        "story": "I (25F) have been with my boyfriend (25M) since high school. Unfortunately, he got into a car crash and became disabled below his waist. I wished to be by his side during his recovery. Disabilities have never been a deal-breaker for me, and I loved him, so while this is going to be a struggle at first, I believed that we'd be able to overcome this.\n\nI tried to participate in his recovery by being there with and for him during physical therapy, I moved into his parents' house to help his parents to take care of him because he is unable to do many tasks without assistance. My job is very close to their parents' place, and my manager allows me to clock-out in case my BF's parents need my help with things like getting my boyfriend to the hospital and such.\n\nBut my boyfriend just completely shut down. I understand that this is a life-changing injury and at such a young age this is absolutely devastating, but he just doesn't want me anywhere near him. I tried to take him out to concerts, plays, organize picnics, trips - just make him believe that his life didn't end with his injury and he is capable of living a fulfilling life. But he was just indifferent to it all. Therapy doesn't seem to help him because he still seems to be completely dissociated from everything.\n\nI couldn't see him like this anymore and I demanded to tell me everything that's on his mind, and he just said that he is angry about everything, that he feels like I'm here only out of moral obligation, that he doesn't feel like a proper boyfriend because he can't do anything for himself, that he wants to be a \"real man\" but he isn't even able to make love to me anymore etc. I tried to be empathetic and told him that if I've been here for this long after the accident, it's obviously not an issue to me because I still love him. He just scoffed and it seemed like he didn't believe me.\n\nNow it's come to a point where he's throwing things at me demanding me to leave the room. He's ignoring me, and when he's not, he insults me. He's even throwing the food I bring him on the floor like a child. He became emotionally abusive, and I'd be lying if I said that I still love him. I genuinely wanted to be there for him because I've seen stories where people after intense physical therapy manage to get back on their feet and walk with some assistance, and I believed that he might be able to do it too - I believe that miracles exist, and the human body is a fascinating thing, maybe he'd be able to walk again, he just needed a lot of work and faith in himself. But he became so nasty, rude, hurtful that... I dunno, I think I just fell out of love with him.\n\nI approached his mum and told her that I feel like I probably don't love him anymore because he's been so hurtful towards me for 2+ years now, and I just can't endure it anymore. I don't deserve this. His mum immediately got defensive saying that he's suffered a great psychological trauma after the accident and it's normal for him to be so depressed. I completely understand that but it doesn't give him a green light to be so hurtful towards people who are actually trying to help him. His mum asked me to stay because my boyfriend needs my support, but judging from his behavior he doesn't want or need me at all. Maybe he's doing it on purpose to push me away, but at this point I don't care anymore - I can't help someone who doesn't want to be helped.\n\nI'm tired. I tried for a long time. He shut me out. I want to break up with him, but I'd feel like an absolute trash human being for leaving a person behind when they need me the most. But at the same time I can't endure this anymore. I want to leave, but I don't want to be \"that person\", if you know what I mean.",
        "gender": "f"

      },
      {
        "summary": "During a vacation in Vegas, I (28F) woke up at 2AM to find my husband (34M) missing, his location off, and thousands in charges from a strip club on our bank account. Where to go from here?",
        "story": "My husband and I booked a last-minute getaway to Vegas for a couple nights, we arrived yesterday.\n\nWe had tickets to see a show last night, but after a long day of drinking in the heat, I wasn't feeling well and needed to end the night early. I encouraged my husband to still go so he could enjoy his evening, so he did and I went to sleep.\n\n2AM rolls around and I wake up to find that he never came back to the room - the show is literally at our hotel so I start to panic. I go to check his location, it's off. Then I text him asking where he was, he reads it and doesn't respond. I call him several times and he sends me to voicemail. While I was trying to get ahold of him, I see there were 2 separate charges for $1,000+ from a strip club. He didn't respond to me till nearly 3AM and just texted he was on his way back.\n\n30 minutes later, he stumbles in the room absolutely obliterated. He tries to lie and say he was just gambling down the strip, that he never went to the strip club even though the charges were literally made with ApplePay and he hadn't lost his phone.\n\nAfter going through his receipts, I found he'd been at the strip club for nearly 5 hours, essen confirming that he went straight from the show and left 40 minutes after my first \"where are you?\" text.\n\nI also checked all of our accounts, and if all the charges made settle as they are, he'll have spent nearly $6,000 there. He swears he \"didn't cheat\" on me and says nothing sexual happened, though I can only imagine the situations you find yourself in after 5 hours in a strip club, especially when you're intoxicated beyond comprehension. I feel like I'll never truly know what happened and that alone is the most painful part.\n\nWe flew home a day early, and I just have no idea where to go from here. We've been together for 7 years, married for 4 years in just a couple months.\n\nAs far as I was aware, we're in a great place in our marriage, and there haven't been any issues with infidelity in the past. This is completely out of character - I'm absolutely crushed and deeply disappointed. He was reckless with our money, with my trust, with our marriage and it really fucking hurts. The fact we were on a solo trip together and instead of coming back to me, or doing literally anything else, he chose to go to a strip club.",
        "gender": "f"

      },
      {
        "summary": "My (F23) boyfriend (M26)'s little brother creeps me out, but my boyfriend isn’t taking it seriously. I don't know what to do?",
        "story": "I (23F) have been with my boyfriend (26M) for almost three years, and we live together. Recently, his parents were arrested (I’d rather not go into the details), and as a result, his little brother (11M) has had to move in with us. I understand the situation is complicated, and my boyfriend didn’t really have a choice – obviously, he couldn’t just leave his brother with nowhere to go.\n\nThe thing is, I find his little brother creepy, and I feel horrible even saying that. I know he's a kid and he’s gone through a traumatic experience, but some of the things he does make me really uncomfortable. For instance, he stares at me a lot, like almost all the time when we’re in the same room. I’ll catch him just watching me, and it’s unsettling. He also has this habit of walking into our bedroom without knocking, especially when my boyfriend is out. I’ve told him multiple times that he needs to knock, but he either ignores it or just doesn't care.\n\nHe will shower and use the bathroom with the door wide open, clearly so everyone can see him when walking past. Even though I have told him he needs to keep the door closed when he's in there. One time, I had just gotten out of the shower and was in my towel when I walked into the bedroom, and he was just standing there, staring at me. I asked him what he was doing, and he didn’t even answer, just kept staring before finally walking away. I brought this up to my boyfriend, but he brushed it off, saying his brother is probably just adjusting to everything and doesn’t mean any harm. I lent him my laptop because he said he needed it for homework and when I got it back it was completely filled with porn, like he had downloaded porn, it was in the search history. I told my boyfriend he needed to speak with him but my boyfriend says it's normal for a boy his age. He just told me to clear the search history and delete what he downloaded. But he is not being normal, he is weirding me out and I feel bad even saying it.\n\nI get that this kid is dealing with a lot – losing his parents like that is traumatic – but at the same time, I feel like my feelings are being dismissed. My boyfriend says I’m overreacting, but I honestly feel really uncomfortable in my own home now. I even find myself avoiding being alone with his brother because it just feels weird.\n\nI don't know if I am overreacting, like I understand giving some leeway because of everything that's happened in his life, but he is really weirding me out.",
        "gender": "f"
      },
      {
        "summary": "I pulled a gun on a gay teenager",
        "story": "My 6yo daughter kept telling me she would see a man sneak in the house sometimes, his entry points would be different every time, sometimes it was a window, then the front door, then the back door, kitchen window etc, she \"sees\" stuff that's not actually happening all the time and this is what me and my wife chalked it up to.\n\nBut that night I thought I saw a figure walk by my window, I ignored it though, but then she ran into our room saying she saw the man from her window sneak into our son's (16m) room and that it sounded like he was hurting our son.\n\nI grabbed my handgun and ran into my son's room to see a shirtless man with facial hair, pointed my gun at him and yelled for him to get out, I flicked on the light to see a much younger than expected man, boy rather, with much less facial hair then the dark had led me to believe. I then look over at my son, also shirtless, and he's completely horrified, quickly I realized what was going on and the \"distress\", my daughter thought her brother was in and felt horrible. The boy ran past me and out the front door. My son hasn't looked at me let alone said a single word to me since.\n\nI pulled a gun and threatened to kill a kid. I feel like shit",
        "gender": "m"
      },
      {
        "summary": "My wife being away on a trip showed me how much I compromised.",
        "story": "I’ll start by saying I love my wife more than anything in the world. She is truly the kindest person I know and her smile makes my heart skip a beat.\n\nBut since she went on her trip I’ve had the best nights and calmest, most productive days of my life.\n\nI can have a full night’s sleep now that I don’t have to let her cats sleep with us (love the little guys but they will try to wake us up at random times during the night, or they’ll play run across the house and dolphin dive on us). I also don’t wake up gasping for air because their hair got sucked up my nose.\n\nDuring the day, I can go to the gym or run errands guilt free and I no longer have to worry about having to spend three to four hours in bed watching a show I don’t like. The house is no longer messy and covered in clothes, the cats no longer break the dozens of glasses she’d leave around and our bed isn’t covered in random food bits.\n\nThat’s all going away pretty soon as she’s coming back, and I know I’ll never see it again because I tried to bring all those things up before and it always ended in huge arguments.",
        "gender": "m"
      },
      {
        "summary": "I helped my student cheat on exams, and I'm not sorry for that!",
        "story": "I am a grad student and I'm a TA for a calculus professor.\n\n\"Karina\" was one of my students. Karina failed this class twice and was trying again over the summer. This was the last math course required for her major. The school's policy is that you get three chances to pass a class.\n\nKarina was desperate and I really wanted to help her. From day one, she put in the effort. Every week, she came to my office hours early and stayed past the end. We did so many practice questions together.\n\nI tried to explain things to her in so many different ways. I brought in other grad students to help her visualize things. We tried to use \"real world examples\" about marine biology (based on the given rate of change, how long it will take for water to drain from this salt marsh, stuff like that). None of it helped. She was still on the verge of failing the class.\n\nI personally think it's silly how she's required to take calculus as a marine biology major. In the future, let's say she needs to estimate how long it will take for water to drain from a salt marshes on Florida’s Gulf Coast during low tides. She can use plenty of tools to help with that. When she's a marine biologist, she will not need to solve calculus problems by hand on a closed-book test.\n\nShe’s actually a really good student in all her other subjects. calculus just wasn’t her thing no matter how hard she tried. I know some people think this is impossible, like \"if you try hard enough, you can accomplish anything,\" but that's not always true.\n\nBefore the first midterm, Karina asked for extra help. I told her I could meet her over the weekend. We met at an obscure coffee shop about 20 minutes away.\n\nThe TAs and the professor wrote the exams together so I had them with me. I helped Karina practice the EXACT questions that would be on the test. I gave her the questions one-by-one and made her repeat them. I think she caught onto what I was doing. We went over each question so many times that she had them memorized like a poem. For the final, I helped her \"study\" the exact same way.\n\nOur exams had \"bonus questions\" that she didn't do, so she didn't set the curve, but she got one of the highest grades.\n\nShe passed the class. She can continue now as a marine biologist and she never has to take calculus again.\n\nI know this was unfair to the other students but I’m not sorry for doing it. I gave Karina a fighting chance. I want to help my students succeed, even if it means playing the game a little differently.\n\nI still see Karina around. She says she will be forever grateful for my help. She says if it hadn't been for me, she might have abandoned her dreams of being a marine biologist.",
        "gender": "m"
      },
      {
        "summary": "Am I the asshole for telling my mom to shut up and accept that my wife and I aren't naming our kids the way she and dad named me and my siblings?",
        "story": "My wife and I (both late 20s) had our first child together in June. Before he was born there was a lot of talk about names from different family members on both sides, but the pressure to tell was on my side specifically. We didn't tell a soul what the name would be until our son was born and we had left the hospital. My parents were disappointed when we announced our sons name.\n\nMy family are very traditional in how they named us. We were each named after grandparents and that's how they feel everyone should name their kids. My wife's family don't have a tradition when it comes to naming babies. They just name them and go. No fuss or insisting on certain names. But my wife's side tends to favor more uncommon and unusual names.\n\nMy wife's and my taste tends to lean a lot more to her side than to mine. Which is how we ended up choosing the name Hollis for our son. This was not something my parents liked because they expected our son to be either Jack (my dad) or Parker (my FIL). But I know they were expecting a little Jack to be born. So that added to their reaction. But they quizzed us on our choice to \"break tradition\" and I told them it wasn't a tradition my wife's family used and we decided we weren't going to have one either.\n\nOver the last couple of months both parents have questioned why, have wanted to discuss other names for future babies. My mom has been the worst by far. She asked why we went with something so unlike the names we have in our family. I told her our family wasn't the only family involved, but that we also didn't take the family tastes into account. We went with what we liked. She pointed out our taste were a lot like my ILs and I said yes, but that it wasn't about my ILs and their taste, it was about my wife's and my taste. I told her I was done discussing it and since that point I now change the topic or end the conversation when she brings it up or refuses to let it go.\n\nWe had a little naming ceremony on Saturday and my mom decided she was going to dig in her heels about the name and she told me we'd picked a stupid name and she hated it, she wanted us to change it and name him Jack or Parker. She told me we had no business breaking a long held tradition in our family and there's a reason those traditions are there so foolish people can't name their babies the worst names imaginable. She also said my ILs must be so smug thinking they'll have at least two stupidly named grandkids like they had all stupidly named kids. I lost my temper. I told her to shut up and accept that we're not naming our kids like she and dad named me and my siblings and I told her she would need to leave and learn to be more respectful because I would not take those insults against my wife or her family lying down. My mom hated being told to shut up and she said I had no excuse for rudeness to her face. I thought she was crazy when she was rude.",
        "gender": "m"
      },
      {
        "summary": "Am I the asshole for taking my clothes off at the Cheesecake Factory?",
        "story": "So me [23F] and my bf [24M] were celebrating our 1 year anniversary and went out to dinner to celebrate. My bf planned it as he knows how much I love the Cheesecake Factory. I REALLY love their cheesecake (this becomes important later)\n\nWell everything was going fine and we were having a good time until an elderly man at the next table scooted his chair out just as our server was approaching, causing him to stumble and spill hot coffee on me( down my back). It was obviously burning and startled me so I instinctively screamed and pulled my shirt up.\n\nI’m pretty small chested so I don’t typically wear a bra and obviously I wasn’t thinking about that when something hot was running down my back burning me so I basically flashed all those at the tables around us. Yes I was embarrassed but at the same time it’s just boobs. I pulled my shirt back down right after realizing what happened but it was up for about 15 seconds. The server apologized over and over but it wasn’t their fault it was all just an accident.\n\nWell anyway after this my bf wanted to leave, like immediately leave. He said that I was being overdramatic for the way I reacted in the situation and maybe I was but it did startle me really bad and it did burn. He told me I had put on a show for everyone in the restaurant especially since I screamed when it happened and that we need to leave.\n\nI told him it’s not that big a deal and that I really want to stay to get cheesecake because it’s my favorite, I eventually even offered to try to get some to go and he was dead set that we need to leave and didn’t understand why I wasn’t mortified.\n\nWe ended up staying but for the rest of the date he kept saying that the men at tables near us were staring at me and probably thinking about me inappropriately but I said it wasn’t my problem if they’re being gross.\n\nWhen we got in the car he told me i ruined our anniversary for making him sit through that and we should have just left and that he can’t believe I would choose a piece of cheesecake over his comfortability. We argued in the car the whole way home about it and Now we haven’t spoken at all today.",
        "gender": "f"
      },
      {
        "summary": "Am I the asshole for locking my girlfriend out of the basement so I could eat in peace?",
        "story": "I am 39 and male. My girlfriend is 41. We have lived together for a bit over a year in my house.\n\nDuring the time that I have lived with my girlfriend, I've become very used to the fact that she really seems to de-stress by complaining. Much of this complaining is about other people in her life, such as her mother and her former co-workers, but much of this complaining is about me and how I'm not meeting her expectations in one way or another.\n\nI'm generally fine listening to her rant and will make all the appropriate motions to show that I'm listening, but a few months back, her complaining increased significantly in frequency.\n\nAgain, I'm happy to listen to her, but one time that I do not want to listen to complaining is when I'm eating. Breakfast time isn't an issue because she's still asleep when I eat it, and lunch time is fine because I work 6 days a week and am out for lunch, but I would really love nothing more than to just have a quiet dinner. It's especially irritating because she gets upset when I don't answer her fast enough, even when I'm chewing. She'll start saying \"Hello? Hello? Hello? Are you even listening?\" as I try to swallow the food quickly and answer her.\n\nI expressed this to her a few months back. I put it as nicely as possible, with the excuse that I don't do well with talking during meal time. If anything it has had the opposite effect. I'm convinced that she's actually timing her complaints to begin when I start eating dinner now. While I'm making my dinner she'll be quiet, and when I sit down waiting for it to cool she'll be quiet. But once the fork reaches my mouth, she'll immediately start complaining.\n\nLast Saturday, I told her that I couldn't deal with her complaining during dinner time anymore, and that if she did it again I would start eating elsewhere. She responded \"Yeah OK fine.\" Then she sat down at the table and stared at me. When I took my first bite, she said, \"Oh by the way, today you kicked one of my shoes when you were putting yours on. It made me feel like you only care about your own things and not mine.\" I stood up and went down to the basement to eat, locking the door behind me.\n\nI've taken to doing this for every day since, and she'll bang on the door at times. At other times she has demanded I give her a key, as I have the only copy. Today she was literally crying and begging me to eat dinner at the table, but I said no. Now she's threatening to take the door off its hinges while I'm at work (so I know I have to lock it from the outside before going tomorrow).\n\nAm I in the wrong here?",
        "gender": "m"
      },
      {
        "summary": "Am I the asshole for leaving my sister’s wedding early after she called my career a “hobby”?",
        "story": "So I (26F) just got back from my sister’s (28F) wedding last weekend, and I’m still pretty upset about what happened. I’m hoping y’all can give me some perspective because right now, I feel like crap.\n\nSome background: My sister Anna and I have always had a complicated relationship. She’s the type-A, always-on-top-of-everything, super successful one, while I’ve always been more laid-back and creative. I’m an artist, and I recently started my own small business selling my paintings and doing commissions. It’s been slow, but it’s starting to pick up, and I’m really proud of it. But my family, especially Anna, has always been a bit dismissive of my career choice. They don’t get why I didn’t go the “traditional” route like she did.\n\nAnyway, fast forward to the wedding. The ceremony was beautiful, and I was honestly so happy for her. I even helped out a lot with the planning, even though I wasn’t the Maid of Honor (that was her best friend). I was doing my best to be there for her because, despite everything, she’s my sister and I love her.\n\nAt the reception, I finally got a moment alone with Anna to congratulate her. I told her how amazing everything was, how happy I was for her, all that stuff. And she just smiles and says, “Thanks! I’m surprised you actually made it. I figured you’d be too busy with your little hobby business.”\n\nI was stunned. Like, did she really just call my career a “hobby”? I kinda laughed it off and said, “It’s not a hobby, it’s my job,” but she just shrugged and said, “Well, it’s not a real job, but I’m glad you’re having fun with it.”\n\nI didn’t know what to say, so I just walked away. I tried to enjoy the rest of the night, but honestly, I couldn’t shake what she said. It felt like she was belittling everything I’ve been working so hard for. So after dinner, I just decided to leave. I didn’t say goodbye to her or anyone, I just grabbed my stuff and left.\n\nNow, my mom is furious with me for “ruining” the night by leaving early, and Anna hasn’t spoken to me since. My dad is trying to stay neutral, but he did say I might’ve overreacted.\n\nI don’t know, maybe I did. But it really hurt hearing her say that, especially on her wedding day when I was just trying to support her.",
        "gender": "m"
      }
    ]
}